{"list":[{"id":"YAeElvmGw8-Ixo8C5iLX-","createdAt":"Jan 02 2022 14:49","title":"The Matrix Resurrections Review: I Just Entered The Mehtrix","author":"Emmanuel \"E-Man\" Noisette","lead":"From visionary filmmaker Lana Wachowski comes The Matrix Resurrections,  the long-awaited fourth film in the groundbreaking franchise that redefined a genre. The new film reunites original stars Keanu Reeves and Carrie-Anne Moss in the iconic roles they made famous, Neo and Trinity. Can this sequel live up to the long awaited hype? We’ll talk about that in this review.","content":"The Good:\r\nThe best thing about The Matrix Resurrections is having Keanu Reeves back in the role of Neo. Thanks to a lot of nostalgia baked into the movie, experiencing Neo’s character again felt like riding a bike after a long period of time. Although he is a bit older and little stiffer, it really doesn’t matter as Reeves pretty much owns this role. It was an unexpected treat to see some of the supporting cast step up more than anticipated. Jessica Henwick (who played “Bugs”) was a definite highlight.\r\n\r\n\r\n\r\nHer action scenes were some of the best moments in the film, and I could easily see a spinoff movie or series being built around her character. Yahya Abdul-Mateen II was also great as “Morpheus”. He really brought to life his version of the character and completely made it his own.  I will say, however, that it was a bit disappointing to see  the visual choices made with his character for the majority of the film.\r\n\r\n\r\n\r\nThe Matrix Resurrections doesn’t want to be a traditional sequel, and you can tell from the plot of the film. What I liked about it was the unique approach to be self aware and very meta in different scenes. There are a lot of references and jokes thrown into the film that only the audience will understand. One can appreciate these callbacks, not just as a fan of the Matrix, but also for the play on the philosophical theme the franchise is based on. (Simulation theory) It was really intriguing to learn about the aftermath and relationship between both the machines and humans.  This was one of the few moments in the film that felt like the essence of what was always intended in the innovative science fiction this franchise touted.\r\n\r\nThe Bad:\r\nI wanted to really like the action scenes, but I just couldn’t get there. The fight scenes came off to be more of a rehash of what we’ve seen so many times before. Given the vast amount of possibilities that come along with downloading various fighting styles or techniques, The Matrix Resurrections barely bothered to tap into anything that would expand the fight scenes. Sure, we get some explosions, lots of guns, and super powered punches being thrown; but is that all this film has to offer?\r\n\r\n\r\n\r\nTo make matters worse, when you really look at what this franchise setup, it seems like even Neo has reached his limit. Every Matrix movie introduced some sort of new ability for the character. This time around, we get a slight variation of a known ability. The first time I saw it, I was happy to see his minor upgrade. Then after the fourth and fifth time of usage in the film, I realized that this Neo hasn’t really grown much at all. For a character who literally could do almost anything they want, this was a missed opportunity to dazzle audiences.\r\n\r\n\r\n\r\nOne other issue is the overly saturated themes at play. Don’t get me wrong, the “power of love” concept is an oldie, but a goodie. It makes perfect sense (on paper) to make this concept the biggest difference maker between humans and machines. However, The Matrix Resurrections gets extremely heavy handed with this to a fault. This theme would’ve worked better as a secondary (rather primary) focus of the film. It almost gets a bit corny with how literal it’s taken by the end of the film too.\r\n\r\nThe Verdict:\r\nThe Matrix Resurrections is an ambitious sequel that trips up on its own trailblazed path. It’s full of bold ideas with poor execution. Maybe it’s a victim of time, whereas we should’ve gotten this movie at an earlier time. It’s not out of the question to suggest that Hollywood has sucked everything out of the Matrix franchise, and thereby leaving nothing much else for audiences to be wow’d by. Maybe the lack of the other Wachowski sibling could be to blame too. Either way, The Matrix Resurrections took a swing and a miss. It totally gets an A for effort, but it lacks the “it factor” that put the franchise on the cinematic map.\r\n\r\n\r\n\r\nAs a HUGE Matrix fan, I have to fully admit that my expectations could play into my viewing experience here. I rewatched the trilogy before going into this film. I saw how the first film still maintained the magic even though it’s been over 20 years. I didn’t care about the outdated and crappy CGI in the second Matrix because I loved how it threw everything at us full bore. I still give a pass to The Matrix Revolutions, because aside from the boring Zion battle, I appreciated Neo’s journey coming to an end. So naturally, I was hoping that The Matrix Resurrections would learn from it’s long hiatus. Maybe the Wachowski’s would see what’s been done, and give us something fresh and new from a visual standpoint. Alas, I didn’t think this stuck the landing, and as a result, I can’t say I’d even care to give this movie a second viewing.\r\n\r\n\r\n\r\nI know expectations are a personal issue and/or bias, but I don’t think we can completely rule it out either. The Matrix franchise is, and was, a big deal. It literally created a new playing field for action and sci-fi movies that still borrow from it to this day. I think that if viewers can go into this movie with lowered expectations then this will be an OK watch. Don’t expect to be blown away, and you’ll avoid potential disappointment. Either way, I’d still say that if you’re a Matrix fan, The Matrix Resurrections is worth the watch. It’s available in theaters and on HBO Max on the same day.","movieTitle":"The Matrix Resurrections","filmYear":"2021","filmDirector":"Lana Wachowski"},{"id":"LPyyt-5MjyPXWn1PoZJUD","createdAt":"Jan 03 2022 23:02","title":"Spider-Man Now Way Home Lives Up To The Hype","author":"Emmanuel \"E-Man\" Noisette","lead":"For the first time in the cinematic history of Spider-Man, our friendly neighborhood hero’s identity is revealed, bringing his Super Hero responsibilities into conflict with his normal life and putting those he cares about most at risk. When he enlists Doctor Strange’s help to restore his secret, the spell tears a hole in their world, releasing the most powerful villains who’ve ever fought a Spider-Man in any universe. Now, Peter will have to overcome his greatest challenge yet, which will not only forever alter his own future but the future of the Multiverse.","content":"The Good:\r\nSpider-Man: No Way Home wasted very little time in getting audience set for an action packed ride. The fight scenes were jaw dropping and exhilarating. I felt like I was watching a WWE wrestling match as one of Spider-Man’s villains slammed him through a building. Of all the Spider-Man films to date, Spider-Man: No Way Home probably had the most crowd pleasing action scenes. The final battle was just pure fun to watch as Spider-Man confronted his greatest challenges. Best of all, I loved how this film utilized Spider-Man’s abilities. You could see much of that in the usage of his webbing and spider-senses. Often times, it felt like you were playing a Spider-Man video game with so many of the unique Spidey moves that were being pulled off.\r\n\r\n\r\n\r\nThe fight scenes weren’t the only sight to see in Spider-Man: No Way Home. The mixture of both technology and magic were visually stunning. Sure, we’ve seen Spidey have his Stark tech and nanotechnology. However, with the inclusion of Doctor Strange and magic into the mix, this took things to a whole new level. When Spidey travels to that magical place with Doctor Strange, I was captivated with the special effects we got to see. In my second viewing of the film, I saw this in 3D, and it made the visuals that much better.\r\n\r\n\r\n\r\nBefore anyone thinks that this film is just full of wall crawling and punching bad guys, there’s a heavy dose of drama to experience as well. While we’ve seen Tom Holland’s Spider-Man face some obstacles in the past, this film has him going through his biggest challenge yet. I’ll admit, that certain moment in the film will have everyone in their feelings. It certainly pulled at the heart strings for sure. Director Jon Watts did a marvelous job at controlling the pacing of the film; especially during these more dramatic moments. He allowed for the audience to truly feel the weight of the situations through the character and the moment. I also appreciated the cinematography and how it enhanced those emotional scenes. The imagery of Spidey watching the news, in the rain, after dealing with his situation is a scene I’ll never forget.\r\n\r\n\r\n\r\nOne of the strongest elements for Spider-Man: No Way Home is the character development for Peter Parker. This movie allowed us to explore of the quintessential themes that have made Spider-Man one of the most relatable characters of all time. While it may have initially seemed frustrating to see Parker go through his naivete, it was also crucial to his maturation in becoming a hero. Juggling between the ideas of what’s moral and personal sacrifice were two themes that this film handled quite well.\r\n\r\n\r\n\r\nOf course, Spider-Man: No Way Home couldn’t have been as enjoyable as it was without some solid performances from the cast. Tom Holland put his acting chops on display as Peter Parker. He was entirely believable in his dramatic and humorous scenes. He’s become so good that you really do believe him to be Peter Parker. While the rest of the supporting cast were good, it was Willem Defoe that seemed like the real scene stealer. He certainly has some of the most memorable scenes in the film without question.\r\n\r\n\r\n\r\nLast but not least, probably some of the most fun things about Spider-Man: No Way Home are all the fun references and surprise cameos. The level of fan service is gratifying for long time Spider-Man fans mainly due to the characters and jokes that appear in the film. Speaking of which, the dialogue in this movie was hilarious at times. Jamie Foxx’s character made reference to who he thought Spider-Man was, and it was pure hilarity. There’s a lot for Spider-Man fans to enjoy one way or another.\r\n\r\nThe Bad:\r\nOne minor knock against Spider-Man: No Way Home could be in the very thing that makes it great; the nostalgia. Despite this probably not being an issue for dedicated Spider-Man fans, a lot of the references to the older movies may not work for everyone. This film does bank on the nostalgia factor pretty heavily from beginning to end. If you haven’t watched the early 2000 Spider-Man movies, and the rest to date, then it can feel as though this film takes too much time with some of its jokes and callbacks.\r\n\r\n\r\n\r\nThere’s a scene, for example, where Peter Parker is referencing his back pains. The scene was humorous for what it was, but it really didn’t add anything to the story. Moments like that are scenes that should’ve been deleted and saved for the “Extras” feature when the movie becomes available for home viewings. I’ll admit that as a Spider-Man fan, the jokes and callbacks didn’t bother me as much, but I can see how they could be an issue if the only Spider-Man movies you’ve seen were the MCU ones alone.\r\n\r\nThe Verdict:\r\nSpider-Man: No Way Home was a thrill seeking ride that is full of heart and everything we love in superhero movies. It taps into the essence of what makes Spider-Man the hero he was created to be. This was an exceptionally well balanced movie that capped a perfect ending of a trilogy. This is easily a top 3 Spider-Man movie of all time sharing the same space as Spider-Man 2 (2004) and Spider-Man: Into the Spider-Verse (2018).\r\n\r\n \r\n\r\n\r\n\r\nI had the chance to watch this movie for a second time, and I was impressed with how well it held up. All of the jokes still landed, and the fight scenes literally had me at the edge of my seat. Best of all, Spider-Man: No Way Home is a legit crowd-pleaser. The cheers from the audience at key moments made the moviegoing experience that much better. If you happen to be one of the 10 people in the world who still hasn’t seen this movie, please hurry to your local theater as soon as you can. Spider-Man: No Way Home is an absolute must watch.","movieTitle":"Spider-Man: No Way Home","filmYear":"2021","filmDirector":"Jon Watts"}]}